# CreateSimpleCompoundStructure Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..CreateSimpleCompoundStructure Method
CompoundStructure Class See Also
---
Creates a non-vertically compound structure comprised of parallel layers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static CompoundStructure CreateSimpleCompoundStructure(
	IList<CompoundStructureLayer> layers
)
```

Visual Basic
---
```text
Public Shared Function CreateSimpleCompoundStructure ( _
	layers As IList(Of CompoundStructureLayer) _
) As CompoundStructure
```

Visual C++
---
```text
public:
static CompoundStructure^ CreateSimpleCompoundStructure(
	IList<CompoundStructureLayer^>^ layers
)
```

# ### Parameters
layers
    Type: System.Collections.Generic..::..IList<(Of <(<'CompoundStructureLayer>)>)> An array which describes the parallel layers of this compound structure.
# ### Return Value
A newly created compound structure.
# Remarks
All layers are in the core, i.e. there are no shell layers created.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | One or more layers is not valid. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace